""" Задача 2: Найдите сумму цифр трехзначного числа.
*Пример:*
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) | """
a =  input('введите 3-х значное число: ');
c = len (a);
if c != 3:
    print ("Ошибка! Необходимо вводить 3-х значное число")
else:
    b =  int (a[0])+ int(a[1])+ int(a[2]);
    print(b,"(", a[0], "+", a[1], "+", a[2], ")")
